In [2]:
import pandas as pd
df=pd.read_csv(r"C:\Users\susmi\OneDrive\Documents\data.csv")
df

,NAME,CLASS,SECTION,ROLLNO,EMAIL,PHNO,MARKS
0,B.Yamuna,AIR,A,37,yamunalovely9@gmail.com,8897859569,95
1,P.Devi,AIR,A,58,gundrasivesaidurga@gmail.com,9347791232,97
2,J.Ramya,AIR,A,52,jivvireddyramyasri@gmailcom,9676976652,90
3,K.Prasanthi,AIR,A,41,kesanakurthiprasanthi@gmail.com,7382934586,85
4,K.V. Niharika,AIR,A,54,karreveeraniharika@gmail.com,9182532802,96
5,K.Sri Niharika,AIR,A,9,karresriniharika@gmail.com,6300408089,90
6,Y.Kaveri,AIR,A,3,yendamurikaveri@gmail.com,7386015549,94
7,P.Durga,AIR,A,24,durgarani@gmail.com,8466845651,89
8,P.Akhila,AIR,A,29,bottaakhila@gmail.com,8397941799,90
9,P.Neelima,AIR,A,36,pinapalaramesh@gmail.com,7386803023,93

In [3]:
df.isnull()

    NAME  CLASS  SECTION  ROLLNO                 EMAIL   PHNO  MARKS
0  False  False    False   False                 False  False  False
1  False  False    False   False                 False  False  False
2  False  False    False   False                 False  False  False
3  False  False    False   False                 False  False  False
4  False  False    False   False                 False  False  False
5  False  False    False   False                 False  False  False
6  False  False    False   False                 False  False  False
7  False  False    False   False                 False  False  False
8  False  False    False   False                 False  False  False
9  False  False    False   False                 False  False  False

In [4]:
df.head()

,NAME,CLASS,SECTION,ROLLNO,EMAIL,PHNO,MARKS
0,B.Yamuna,AIR,A,37,yamunalovely9@gmail.com,8897859569,95
1,P.Devi,AIR,A,58,gundrasivesaidurga@gmail.com,9347791232,97
2,J.Ramya,AIR,A,52,jivvireddyramyasri@gmailcom,9676976652,90
3,K.Prasanthi,AIR,A,41,kesanakurthiprasanthi@gmail.com,7382934586,85
4,K.V. Niharika,AIR,A,54,karreveeraniharika@gmail.com,9182532802,96

In [5]:
df.tail()

,NAME,CLASS,SECTION,ROLLNO,EMAIL,PHNO,MARKS
5,K.Sri Niharika,AIR,A,9,karresriniharika@gmail.com,6300408089,90
6,Y.Kaveri,AIR,A,3,yendamurikaveri@gmail.com,7386015549,94
7,P.Durga,AIR,A,24,durgarani@gmail.com,8466845651,89
8,P.Akhila,AIR,A,29,bottaakhila@gmail.com,8397941799,90
9,P.Neelima,AIR,A,36,pinapalaramesh@gmail.com,7386803023,93

In [6]:
df['MARKS']=df['MARKS'].fillna(df['MARKS'].mean())
df['MARKS']

0    95
1    97
2    90
3    85
4    96
5    90
6    94
7    89
8    90
9    93
Name: MARKS, dtype: int64

In [7]:
df['MARKS']=df['MARKS'].fillna(df['MARKS'].sum())
df['MARKS']

0    95
1    97
2    90
3    85
4    96
5    90
6    94
7    89
8    90
9    93
Name: MARKS, dtype: int64

In [8]:
df.shape

(10, 7)

In [9]:
df.columns

Index(['NAME', 'CLASS', 'SECTION', 'ROLLNO', '               EMAIL', 'PHNO',
       'MARKS'],
      dtype='object')

In [10]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [11]:
df.dtypes

NAME                    object
CLASS                   object
SECTION                 object
ROLLNO                   int64
               EMAIL    object
PHNO                     int64
MARKS                    int64
dtype: object

In [12]:
df.NAME

0          B.Yamuna
1            P.Devi
2          J.Ramya
3       K.Prasanthi
4     K.V. Niharika
5    K.Sri Niharika
6          Y.Kaveri
7           P.Durga
8          P.Akhila
9         P.Neelima
Name: NAME, dtype: object

In [13]:
df.info

<bound method DataFrame.info of              NAME CLASS SECTION  ROLLNO                            EMAIL  \
0        B.Yamuna   AIR       A      37          yamunalovely9@gmail.com
1          P.Devi   AIR       A      58     gundrasivesaidurga@gmail.com
2        J.Ramya    AIR       A      52      jivvireddyramyasri@gmailcom
3     K.Prasanthi   AIR       A      41  kesanakurthiprasanthi@gmail.com
4   K.V. Niharika   AIR       A      54     karreveeraniharika@gmail.com
5  K.Sri Niharika   AIR       A       9       karresriniharika@gmail.com
6        Y.Kaveri   AIR       A       3        yendamurikaveri@gmail.com
7         P.Durga   AIR       A      24              durgarani@gmail.com
8        P.Akhila   AIR       A      29            bottaakhila@gmail.com
9       P.Neelima   AIR       A      36         pinapalaramesh@gmail.com

         PHNO  MARKS
0  8897859569     95
1  9347791232     97
2  9676976652     90
3  7382934586     85
4  9182532802     96
5  6300408089     90
6  7386015549     94
7  8466845651     89
8  8397941799     90
9  7386803023     93  >